# U.Group Coding Challenge Answers
## J. Mark Daniels

### Given there are no DateTimes this notebook proceeds under the assumption this is one month's worth of data and additional months will come in a similar csv file.

##### Modifications of this structure may be made to update systems in real time.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('cars.db')
c = conn.cursor()

In [3]:
c.execute('''SELECT *
            FROM Sales
            ;''')

df_Sales = pd.DataFrame(c.fetchall())
df_Sales.columns = [x[0] for x in c.description]

df_Sales.head()

,VIN,CarYear,Color,VehBody,EngineType,Make,Miles,Odometer,Brand,VehType,LocationNum,CarType,EngineLiters,FuelType,Transmission,SaleLoc,PurchVal
0,1G1AL15F777226903,2007,Silver,2 Door,4 Cylinder,COBALT LT,117029.0,Accurate,CHEVROLET,Passenger,86,Compact,2.2L,Gasoline,Automatic,86,4900
1,5NPEU46C66H126152,2006,Silver,4 Door,4 Cylinder,SONATA GLS/LX,108890.0,Accurate,HYUNDAI,Passenger,189,Full-size,2.4L,Gasoline,Automatic,189,5700
2,3MEHM08Z48R665374,2008,White,4 Door,4 Cylinder,MILAN,138000.0,Accurate,MERCURY,Passenger,360,Full-size,2.3L,Gasoline,Automatic,360,2890
3,1HGCP2F81AA000524,2010,Red,4 Door,4 Cylinder,ACCORD,89643.0,Accurate,HONDA,Passenger,302,Mid-size,2.4L,Gasoline,Automatic,302,9000
4,2G2WC52C951325364,2005,Maroon,4 Door,8 Cylinder,GRAND PRIX,127806.0,Accurate,PONTIAC,Passenger,295,Full-size,5.3L,Gasoline,Automatic,295,4000

### Check to see if PurchVal values are Integers

In [5]:
df_Sales['PurchVal'][0]

4900

In [6]:
type(df_Sales['PurchVal'][0])

int

### Create Store Table

In [7]:
SaleStores = set([x for x in df_Sales['SaleLoc']])

{1,
 109,
 110,
 111,
 112,
 113,
 117,
 119,
 125,
 133,
 138,
 140,
 148,
 149,
 151,
 158,
 168,
 185,
 187,
 188,
 189,
 199,
 201,
 214,
 215,
 222,
 223,
 225,
 228,
 237,
 238,
 243,
 249,
 250,
 251,
 255,
 256,
 261,
 291,
 292,
 295,
 296,
 300,
 302,
 304,
 306,
 308,
 310,
 314,
 315,
 318,
 323,
 325,
 329,
 33,
 332,
 339,
 34,
 341,
 343,
 345,
 348,
 349,
 355,
 359,
 36,
 360,
 362,
 364,
 365,
 366,
 368,
 37,
 370,
 371,
 374,
 378,
 38,
 380,
 382,
 383,
 385,
 386,
 388,
 390,
 391,
 393,
 394,
 396,
 397,
 398,
 400,
 402,
 404,
 405,
 406,
 409,
 411,
 412,
 414,
 420,
 421,
 422,
 423,
 425,
 429,
 432,
 434,
 437,
 438,
 439,
 440,
 441,
 442,
 444,
 446,
 448,
 450,
 451,
 454,
 456,
 457,
 461,
 463,
 464,
 465,
 466,
 468,
 470,
 472,
 474,
 475,
 477,
 481,
 483,
 484,
 485,
 487,
 488,
 491,
 493,
 494,
 495,
 498,
 5,
 500,
 502,
 504,
 506,
 508,
 509,
 511,
 514,
 516,
 518,
 520,
 521,
 524,
 526,
 528,
 529,
 533,
 535,
 537,
 539,
 541,
 545,
 549,
 551,
 552,
 553,
 556,
 57,
 59,
 61,
 62,
 67,
 69,
 72,
 74,
 76,
 77,
 79,
 80,
 81,
 82,
 84,
 85,
 86,
 87,
 9,
 'Color'}

In [8]:
LocStores = set([x for x in df_Sales['LocationNum']])

{1,
 5,
 9,
 33,
 34,
 36,
 37,
 38,
 57,
 59,
 61,
 62,
 67,
 69,
 72,
 74,
 76,
 77,
 79,
 80,
 81,
 82,
 84,
 85,
 86,
 87,
 109,
 110,
 111,
 112,
 113,
 117,
 119,
 125,
 133,
 138,
 140,
 148,
 149,
 151,
 158,
 168,
 185,
 187,
 188,
 189,
 199,
 201,
 214,
 215,
 222,
 223,
 225,
 228,
 237,
 238,
 243,
 249,
 250,
 251,
 255,
 256,
 261,
 291,
 292,
 295,
 296,
 300,
 302,
 304,
 306,
 308,
 310,
 314,
 315,
 318,
 323,
 325,
 329,
 332,
 339,
 341,
 343,
 345,
 348,
 349,
 355,
 359,
 360,
 362,
 364,
 365,
 366,
 368,
 370,
 371,
 374,
 378,
 380,
 382,
 383,
 385,
 386,
 388,
 390,
 391,
 393,
 394,
 396,
 397,
 398,
 400,
 402,
 404,
 405,
 406,
 409,
 411,
 412,
 414,
 420,
 421,
 422,
 423,
 425,
 427,
 429,
 432,
 434,
 437,
 438,
 439,
 440,
 441,
 442,
 444,
 446,
 448,
 450,
 451,
 454,
 456,
 457,
 461,
 463,
 464,
 465,
 466,
 468,
 470,
 472,
 474,
 475,
 477,
 481,
 483,
 484,
 485,
 487,
 488,
 491,
 493,
 494,
 495,
 498,
 500,
 502,
 504,
 506,
 508,
 509,
 511,
 514,
 516,
 518,
 520,
 521,
 524,
 526,
 528,
 529,
 533,
 535,
 537,
 539,
 541,
 545,
 549,
 551,
 552,
 553,
 556}

In [9]:
len(LocStores) == len(SaleStores)

True

In [10]:
len(LocStores)

192

In [50]:
df_stores = pd.DataFrame(LocStores)
df_stores.sort_values(by=[0],inplace=True)
df_stores['Store_ID'] = range(1,(len(LocStores)+1))
df_stores = df_stores.rename(columns={0: "Store"}, errors="raise")
df_stores

    Store  Store_ID
0       1         1
3       5         2
7       9         3
17     33         4
18     34         5
..    ...       ...
24    549       188
23    551       189
25    552       190
26    553       191
27    556       192

[192 rows x 2 columns]

### Create VIN Table

In [53]:
VIN = [x for x in df_Sales['VIN']]

In [56]:
df_vin = pd.DataFrame(VIN)
df_vin['VIN_ID'] = range(1,(len(VIN)+1))
df_vin = df_vin.rename(columns={0: "VIN"}, errors="raise")
df_vin

                     VIN  VIN_ID
0      1G1AL15F777226903       1
1      5NPEU46C66H126152       2
2      3MEHM08Z48R665374       3
3      1HGCP2F81AA000524       4
4      2G2WC52C951325364       5
...                  ...     ...
22783  1G1AL58F787211970   22784
22784  2FTRF17274CA55319   22785
22785  1FMCU03108KC39727   22786
22786  4A3AB26FX4E088213   22787
22787  1G4HP52K834149596   22788

[22788 rows x 2 columns]

#### Check to see if same cars are going in and out of inventory

In [59]:
len(set(VIN))

11367

### Create Fact Table for All Sales Transactions

### Create Aggregation Features

### Export to SQLite